from setuptools import setup


setup(
    name="ak-47",
    version="1.0",
    description="A tool for various network tasks.",
    author="Robot",
    packages=["your_package_name"],  # استبدل باسم الحزمة الخاصة بك
    install_requires=[
        "colorama",  # مكتبة ملونة للنصوص
        "requests",  # مكتبة HTTP
        # أضف مكتبات أخرى حسب الحاجة
    ],
    entry_points={
        'console_scripts': [
            'ak-47=your_module:main',  # استبدل `your_module` بوحدة بدء التشغيل
        ],
    },
)

# طباعة الشعار
def print_logo():
    logo = """
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣿⣿⣿⣿⣿⣷⣶⣶⣶⣶⣶⡶⣶⣦⣤⣤⣤⣤⣄⠀⠀⠀⠀⠀⣰⣿⡇⠀
⠀⠀⠀⠀⢀⣀⣀⣀⣀⣀⣤⣄⣀⣀⣠⣤⡤⣾⣭⣭⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣟⣿⢓⣷⢞⣿⣿⣷⣺⣿⣿⣿⣿⣿⣿⣷⣶⣶⣤⣴⣿⣿⣷⣄
⣾⣟⠛⠛⡍⠉⢉⠉⠉⢈⠉⢉⣽⣷⣿⣶⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣧⣿⣿⣿⣿⣿⣿⡿⠿⠿⠛⠛⠛⠛⠻⠟⠛⠛⠛⠛⠛⠛⠿⠋⠁
⢿⣧⣖⣋⣶⣾⣿⣿⣿⣿⣷⣿⣿⡿⠿⠛⠻⣿⣿⣿⣿⣿⣧⣜⣿⣿⣿⣿⣿⣿⣷⠀⠀⠀⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⢸⣷⣿⣿⣿⣿⣿⣿⡿⠟⠛⠋⠀⠀⠀⠀⣰⣿⣿⣿⠟⠙⠛⠛⠃⠘⣿⣿⣿⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠿⠿⠟⠛⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⢰⣿⣿⣿⡏⠀⠀⠀⠀⠀⠀⠘⣿⣿⣿⣿⣿⣦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⠻⠿⠟⠃⠀⠀⠀⠀⠀⠀⠀⠘⣿⣿⣿⣿⣿⣷⣤⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠻⣿⣿⣿⣿⣿⡿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠻⣿⣿⠟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
    """
    print(logo)

if __name__ == "__main__":
    print_logo()
